# 変数の種類（変数名の例はhello）

# ■ローカル変数
# 小文字またはアンダーバーから始まる変数名 hello または _hello
# Rubyの変数の中で最もポピュラーな変数
# メソッドの中で定義した変数と、メソッドの外で定義した変数は別の変数として扱われるのでスコープに注意

# ■グローバル変数
# $で始まる変数名 $hello
# グローバル変数はローカル変数とは異なり、一度変数を定義することで、別のrbファイルでも変数を参照することができる。

# サンプル
# ローカル変数を定義する
hello_local = "ローカル変数に文字列を格納している"

# グローバル変数を定義する
$hello_global = "グローバル変数に文字列を格納する"

# 別のファイル(variableB)を読み込む
require_relative "variableB"

puts "ローカル変数"
puts hello_local

puts "-----------------------"

puts "グローバル変数"
puts $hello_global

# ■インスタンス変数
# 変数名の先頭に@をつける @hello


# ■クラス変数
# 変数名の先頭に@@を付ける @@hello

# ■定数
# 定数を定義
# 最初の一文字目を大文字で定義することで「定数」となる。
DEFAULT_NAME = "Taro"
DEFAULT_PRICE = 100

# 定数の定義
PI = 3.14
# 円の半径
radius = 5

# 円の面積の計算
area = PI * radius ** 2

# 結果の出力
puts "半径 #{radius} の円の面積は #{area} です。"